stoprocent/arduino-kontakt/nRF51822/boards.txt
menu.SoftDevice=Soft Device

##############################################################

Kontakt_io_Smart_Beacon_22.name=Smart Beacon v2.2
Kontakt_io_Smart_Beacon_22.upload.tool=openocd
Kontakt_io_Smart_Beacon_22.upload.protocol=
Kontakt_io_Smart_Beacon_22.upload.maximum_size=262144
Kontakt_io_Smart_Beacon_22.upload.maximum_data_size=16384
Kontakt_io_Smart_Beacon_22.upload.speed=115200
Kontakt_io_Smart_Beacon_22.upload.disable_flushing=false
Kontakt_io_Smart_Beacon_22.upload.use_1200bps_touch=false
Kontakt_io_Smart_Beacon_22.upload.wait_for_upload_port=false
Kontakt_io_Smart_Beacon_22.bootloader.tool=openocd
Kontakt_io_Smart_Beacon_22.build.mcu=cortex-m0
Kontakt_io_Smart_Beacon_22.build.f_cpu=16000000
Kontakt_io_Smart_Beacon_22.build.usb_product="Arduino Kontakt"
Kontakt_io_Smart_Beacon_22.build.board=KONTAKTIO_nRF51822
Kontakt_io_Smart_Beacon_22.build.core=KONTAKTIO_nRF51822
Kontakt_io_Smart_Beacon_22.build.variant=Smart_Beacon_22
Kontakt_io_Smart_Beacon_22.build.extra_flags=-mthumb
Kontakt_io_Smart_Beacon_22.menu.SoftDevice.110=S110
Kontakt_io_Smart_Beacon_22.menu.SoftDevice.110.build.softdevice=110
Kontakt_io_Smart_Beacon_22.menu.SoftDevice.130=S130
Kontakt_io_Smart_Beacon_22.menu.SoftDevice.130.build.softdevice=130
Kontakt_io_Smart_Beacon_22.build.softdevice="110"
Kontakt_io_Smart_Beacon_22.build.ldscript=linker_scripts/gcc/KONTAKTIO_nRF51822_{build.softdevice}.ld
Kontakt_io_Smart_Beacon_22.build.ld_include="-L{runtime.platform.path}/variants/Common/linker_scripts/gcc"
Kontakt_io_Smart_Beacon_22.build.ble_api_include="-I{runtime.platform.path}/cores/KONTAKTIO_nRF51822/ARMmbed/ble" "-I{runtime.platform.path}/cores/KONTAKTIO_nRF51822/ARMmbed/ble/ble/services" "-I{runtime.platform.path}/cores/KONTAKTIO_nRF51822/ARMmbed/ble/source" "-I{runtime.platform.path}/cores/KONTAKTIO_nRF51822/ARMmbed/ble/source/services"
Kontakt_io_Smart_Beacon_22.build.nRF51_api_include="-I{runtime.platform.path}/cores/KONTAKTIO_nRF51822/ARMmbed/ble-nrf51822/source" "-I{runtime.platform.path}/cores/KONTAKTIO_nRF51822/ARMmbed/ble-nrf51822/source/btle" "-I{runtime.platform.path}/cores/KONTAKTIO_nRF51822/ARMmbed/ble-nrf51822/source/btle/custom" "-I{runtime.platform.path}/cores/KONTAKTIO_nRF51822/ARMmbed/ble-nrf51822/source/common" 
Kontakt_io_Smart_Beacon_22.build.nRF51822_ble_api_include="-I{runtime.platform.path}/cores/KONTAKTIO_nRF51822/ARMmbed/nrf51-sdk/source/nordic_sdk/components/ble/ble_radio_notification" "-I{runtime.platform.path}/cores/KONTAKTIO_nRF51822/ARMmbed/nrf51-sdk/source/nordic_sdk/components/ble/ble_services/ble_dfu" "-I{runtime.platform.path}/cores/KONTAKTIO_nRF51822/ARMmbed/nrf51-sdk/source/nordic_sdk/components/ble/common" "-I{runtime.platform.path}/cores/KONTAKTIO_nRF51822/ARMmbed/nrf51-sdk/source/nordic_sdk/components/ble/device_manager" "-I{runtime.platform.path}/cores/KONTAKTIO_nRF51822/ARMmbed/nrf51-sdk/source/nordic_sdk/components/ble/device_manager/config" "-I{runtime.platform.path}/cores/KONTAKTIO_nRF51822/ARMmbed/nrf51-sdk/source/nordic_sdk/components/ble/peer_manager" "-I{runtime.platform.path}/cores/KONTAKTIO_nRF51822/ARMmbed/nrf51-sdk/source/nordic_sdk/components/device" "-I{runtime.platform.path}/cores/KONTAKTIO_nRF51822/ARMmbed/nrf51-sdk/source/nordic_sdk/components/drivers_nrf/ble_flash" "-I{runtime.platform.path}/cores/KONTAKTIO_nRF51822/ARMmbed/nrf51-sdk/source/nordic_sdk/components/drivers_nrf/delay" "-I{runtime.platform.path}/cores/KONTAKTIO_nRF51822/ARMmbed/nrf51-sdk/source/nordic_sdk/components/drivers_nrf/hal" "-I{runtime.platform.path}/cores/KONTAKTIO_nRF51822/ARMmbed/nrf51-sdk/source/nordic_sdk/components/drivers_nrf/pstorage" "-I{runtime.platform.path}/cores/KONTAKTIO_nRF51822/ARMmbed/nrf51-sdk/source/nordic_sdk/components/drivers_nrf/pstorage/config" "-I{runtime.platform.path}/cores/KONTAKTIO_nRF51822/ARMmbed/nrf51-sdk/source/nordic_sdk/components/libraries/bootloader_dfu" "-I{runtime.platform.path}/cores/KONTAKTIO_nRF51822/ARMmbed/nrf51-sdk/source/nordic_sdk/components/libraries/bootloader_dfu/hci_transport" "-I{runtime.platform.path}/cores/KONTAKTIO_nRF51822/ARMmbed/nrf51-sdk/source/nordic_sdk/components/libraries/crc16" "-I{runtime.platform.path}/cores/KONTAKTIO_nRF51822/ARMmbed/nrf51-sdk/source/nordic_sdk/components/libraries/experimental_section_vars" "-I{runtime.platform.path}/cores/KONTAKTIO_nRF51822/ARMmbed/nrf51-sdk/source/nordic_sdk/components/libraries/fds" "-I{runtime.platform.path}/cores/KONTAKTIO_nRF51822/ARMmbed/nrf51-sdk/source/nordic_sdk/components/libraries/fstorage" "-I{runtime.platform.path}/cores/KONTAKTIO_nRF51822/ARMmbed/nrf51-sdk/source/nordic_sdk/components/libraries/hci" "-I{runtime.platform.path}/cores/KONTAKTIO_nRF51822/ARMmbed/nrf51-sdk/source/nordic_sdk/components/libraries/scheduler" "-I{runtime.platform.path}/cores/KONTAKTIO_nRF51822/ARMmbed/nrf51-sdk/source/nordic_sdk/components/libraries/timer" "-I{runtime.platform.path}/cores/KONTAKTIO_nRF51822/ARMmbed/nrf51-sdk/source/nordic_sdk/components/libraries/util" "-I{runtime.platform.path}/cores/KONTAKTIO_nRF51822/ARMmbed/nrf51-sdk/source/nordic_sdk/components/softdevice/common/softdevice_handler" "-I{runtime.platform.path}/cores/KONTAKTIO_nRF51822/ARMmbed/nrf51-sdk/source/nordic_sdk/components/softdevice/s{build.softdevice}/headers"
Kontakt_io_Smart_Beacon_22.build.mbed_api_include="-I{runtime.platform.path}/cores/KONTAKTIO_nRF51822/ARMmbed/mbed/api" "-I{runtime.platform.path}/cores/KONTAKTIO_nRF51822/ARMmbed/mbed/common" "-I{runtime.platform.path}/cores/KONTAKTIO_nRF51822/ARMmbed/mbed/hal" "-I{runtime.platform.path}/cores/KONTAKTIO_nRF51822/ARMmbed/mbed/targets/cmsis" "-I{runtime.platform.path}/cores/KONTAKTIO_nRF51822/ARMmbed/mbed/targets/cmsis/TARGET_NORDIC/TARGET_MCU_NRF51822/" "-I{runtime.platform.path}/cores/KONTAKTIO_nRF51822/ARMmbed/mbed/targets/hal/TARGET_NORDIC/TARGET_MCU_NRF51822" "-I{runtime.platform.path}/cores/KONTAKTIO_nRF51822/ARMmbed/mbed/targets/hal/TARGET_NORDIC/TARGET_MCU_NRF51822/TARGET_KONTAKTIO_SMART_BEACON_22"

##############################################################

Kontakt_io_Smart_Beacon_24.name=Smart Beacon v2.4
Kontakt_io_Smart_Beacon_24.upload.tool=openocd
Kontakt_io_Smart_Beacon_24.upload.protocol=
Kontakt_io_Smart_Beacon_24.upload.maximum_size=262144
Kontakt_io_Smart_Beacon_24.upload.maximum_data_size=16384
Kontakt_io_Smart_Beacon_24.upload.speed=115200
Kontakt_io_Smart_Beacon_24.upload.disable_flushing=false
Kontakt_io_Smart_Beacon_24.upload.use_1200bps_touch=false
Kontakt_io_Smart_Beacon_24.upload.wait_for_upload_port=false
Kontakt_io_Smart_Beacon_24.bootloader.tool=openocd
Kontakt_io_Smart_Beacon_24.build.mcu=cortex-m0
Kontakt_io_Smart_Beacon_24.build.f_cpu=16000000
Kontakt_io_Smart_Beacon_24.build.usb_product="Arduino Kontakt"
Kontakt_io_Smart_Beacon_24.build.board=KONTAKTIO_nRF51822
Kontakt_io_Smart_Beacon_24.build.core=KONTAKTIO_nRF51822
Kontakt_io_Smart_Beacon_24.build.variant=Smart_Beacon_24
Kontakt_io_Smart_Beacon_24.build.extra_flags=-mthumb
Kontakt_io_Smart_Beacon_24.menu.SoftDevice.110=S110
Kontakt_io_Smart_Beacon_24.menu.SoftDevice.110.build.softdevice=110
Kontakt_io_Smart_Beacon_24.menu.SoftDevice.130=S130
Kontakt_io_Smart_Beacon_24.menu.SoftDevice.130.build.softdevice=130
Kontakt_io_Smart_Beacon_24.build.softdevice="110"
Kontakt_io_Smart_Beacon_24.build.ldscript=linker_scripts/gcc/KONTAKTIO_nRF51822_{build.softdevice}.ld
Kontakt_io_Smart_Beacon_24.build.ld_include="-L{runtime.platform.path}/variants/Common/linker_scripts/gcc"
Kontakt_io_Smart_Beacon_24.build.ble_api_include="-I{runtime.platform.path}/cores/KONTAKTIO_nRF51822/ARMmbed/ble" "-I{runtime.platform.path}/cores/KONTAKTIO_nRF51822/ARMmbed/ble/ble/services" "-I{runtime.platform.path}/cores/KONTAKTIO_nRF51822/ARMmbed/ble/source" "-I{runtime.platform.path}/cores/KONTAKTIO_nRF51822/ARMmbed/ble/source/services"
Kontakt_io_Smart_Beacon_24.build.nRF51_api_include="-I{runtime.platform.path}/cores/KONTAKTIO_nRF51822/ARMmbed/ble-nrf51822/source" "-I{runtime.platform.path}/cores/KONTAKTIO_nRF51822/ARMmbed/ble-nrf51822/source/btle" "-I{runtime.platform.path}/cores/KONTAKTIO_nRF51822/ARMmbed/ble-nrf51822/source/btle/custom" "-I{runtime.platform.path}/cores/KONTAKTIO_nRF51822/ARMmbed/ble-nrf51822/source/common" 
Kontakt_io_Smart_Beacon_24.build.nRF51822_ble_api_include="-I{runtime.platform.path}/cores/KONTAKTIO_nRF51822/ARMmbed/nrf51-sdk/source/nordic_sdk/components/ble/ble_radio_notification" "-I{runtime.platform.path}/cores/KONTAKTIO_nRF51822/ARMmbed/nrf51-sdk/source/nordic_sdk/components/ble/ble_services/ble_dfu" "-I{runtime.platform.path}/cores/KONTAKTIO_nRF51822/ARMmbed/nrf51-sdk/source/nordic_sdk/components/ble/common" "-I{runtime.platform.path}/cores/KONTAKTIO_nRF51822/ARMmbed/nrf51-sdk/source/nordic_sdk/components/ble/device_manager" "-I{runtime.platform.path}/cores/KONTAKTIO_nRF51822/ARMmbed/nrf51-sdk/source/nordic_sdk/components/ble/device_manager/config" "-I{runtime.platform.path}/cores/KONTAKTIO_nRF51822/ARMmbed/nrf51-sdk/source/nordic_sdk/components/ble/peer_manager" "-I{runtime.platform.path}/cores/KONTAKTIO_nRF51822/ARMmbed/nrf51-sdk/source/nordic_sdk/components/device" "-I{runtime.platform.path}/cores/KONTAKTIO_nRF51822/ARMmbed/nrf51-sdk/source/nordic_sdk/components/drivers_nrf/ble_flash" "-I{runtime.platform.path}/cores/KONTAKTIO_nRF51822/ARMmbed/nrf51-sdk/source/nordic_sdk/components/drivers_nrf/delay" "-I{runtime.platform.path}/cores/KONTAKTIO_nRF51822/ARMmbed/nrf51-sdk/source/nordic_sdk/components/drivers_nrf/hal" "-I{runtime.platform.path}/cores/KONTAKTIO_nRF51822/ARMmbed/nrf51-sdk/source/nordic_sdk/components/drivers_nrf/pstorage" "-I{runtime.platform.path}/cores/KONTAKTIO_nRF51822/ARMmbed/nrf51-sdk/source/nordic_sdk/components/drivers_nrf/pstorage/config" "-I{runtime.platform.path}/cores/KONTAKTIO_nRF51822/ARMmbed/nrf51-sdk/source/nordic_sdk/components/libraries/bootloader_dfu" "-I{runtime.platform.path}/cores/KONTAKTIO_nRF51822/ARMmbed/nrf51-sdk/source/nordic_sdk/components/libraries/bootloader_dfu/hci_transport" "-I{runtime.platform.path}/cores/KONTAKTIO_nRF51822/ARMmbed/nrf51-sdk/source/nordic_sdk/components/libraries/crc16" "-I{runtime.platform.path}/cores/KONTAKTIO_nRF51822/ARMmbed/nrf51-sdk/source/nordic_sdk/components/libraries/experimental_section_vars" "-I{runtime.platform.path}/cores/KONTAKTIO_nRF51822/ARMmbed/nrf51-sdk/source/nordic_sdk/components/libraries/fds" "-I{runtime.platform.path}/cores/KONTAKTIO_nRF51822/ARMmbed/nrf51-sdk/source/nordic_sdk/components/libraries/fstorage" "-I{runtime.platform.path}/cores/KONTAKTIO_nRF51822/ARMmbed/nrf51-sdk/source/nordic_sdk/components/libraries/hci" "-I{runtime.platform.path}/cores/KONTAKTIO_nRF51822/ARMmbed/nrf51-sdk/source/nordic_sdk/components/libraries/scheduler" "-I{runtime.platform.path}/cores/KONTAKTIO_nRF51822/ARMmbed/nrf51-sdk/source/nordic_sdk/components/libraries/timer" "-I{runtime.platform.path}/cores/KONTAKTIO_nRF51822/ARMmbed/nrf51-sdk/source/nordic_sdk/components/libraries/util" "-I{runtime.platform.path}/cores/KONTAKTIO_nRF51822/ARMmbed/nrf51-sdk/source/nordic_sdk/components/softdevice/common/softdevice_handler" "-I{runtime.platform.path}/cores/KONTAKTIO_nRF51822/ARMmbed/nrf51-sdk/source/nordic_sdk/components/softdevice/s{build.softdevice}/headers"
Kontakt_io_Smart_Beacon_24.build.mbed_api_include="-I{runtime.platform.path}/cores/KONTAKTIO_nRF51822/ARMmbed/mbed/api" "-I{runtime.platform.path}/cores/KONTAKTIO_nRF51822/ARMmbed/mbed/common" "-I{runtime.platform.path}/cores/KONTAKTIO_nRF51822/ARMmbed/mbed/hal" "-I{runtime.platform.path}/cores/KONTAKTIO_nRF51822/ARMmbed/mbed/targets/cmsis" "-I{runtime.platform.path}/cores/KONTAKTIO_nRF51822/ARMmbed/mbed/targets/cmsis/TARGET_NORDIC/TARGET_MCU_NRF51822/" "-I{runtime.platform.path}/cores/KONTAKTIO_nRF51822/ARMmbed/mbed/targets/hal/TARGET_NORDIC/TARGET_MCU_NRF51822" "-I{runtime.platform.path}/cores/KONTAKTIO_nRF51822/ARMmbed/mbed/targets/hal/TARGET_NORDIC/TARGET_MCU_NRF51822/TARGET_KONTAKTIO_SMART_BEACON_24"

